Revit 2024 API
RebarShape.GetRebarShapeDefinition Method
 Return the definition of the RebarShape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public RebarShapeDefinition GetRebarShapeDefinition()
Visual Basic
Public Function GetRebarShapeDefinition As RebarShapeDefinition
Visual C++
public:
RebarShapeDefinition^ GetRebarShapeDefinition()
Return Value
 A copy of the definition. Changes will not affect the RebarShape.
Remarks
 Replaces the property RebarShape.Definition from previous releases.
See Also
RebarShape Class
Autodesk.Revit.DB.Structure Namespace